---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CurtainWallFailures.InvalidSkipSegments
source: html/ef0a2495-3ca7-aae9-b637-33e6701c974d.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CurtainWallFailures.InvalidSkipSegments Property

A curtain grid line had invalid removed segment data. When correcting data, Revit may have split curtain panels that should be combined.

## Syntax (C#)
```csharp
public static FailureDefinitionId InvalidSkipSegments { get; }
```